<?php
echo    
'
<style>
*,h1,h3,h2,h4,h5{margin:10px 0}
</style>
<h3>php语言开发</h3>
1.php中文名：超文本处理器<br>
2.吸收其他语言特点<br>
3.可以嵌入式开发<br>
4.需求量大<br>
5.搭建本地网站环境，浏览器打开php文件<br>

<h3>php是一门开发语言</h3> 
针对开发语言的软件，称之为开发环境

<h3>环境</h3>
1. 服务器和电脑<br>
2.集成环境包：网页服务器，数据库服务器，php解析器组成<br>
3.怎样选择环境包 更新快 操作简单，选择性不要太多<br>
4.安装环境包 例：phpstudy

<h3>开发环境</h3>
1.windows<br>
2.linx<br>
3.Mac<br>
4.在线环境<br>
5.其他<br>

<h3>工具选择</h3>
1.新手尽量不要用联想度高、自动提示的工具：如NotePad++ phpstorm<br>
2.写完代码，必须有高亮显示<br>
3.Mac<br>
4.在线环境<br>
5.其他<br>


'

?>